{
  "model_type": "lumen",
  "architectures": ["LumenForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "intermediate_size": 14336,
  "vocab_size": 128256,
  "max_position_embeddings": 32768,
  "rope_theta": 1000000.0,
  "sliding_window_size": 4096,
  "vision_hidden_size": 768,
  "vision_image_size": 384,
  "audio_num_mel_bins": 80,
  "multimodal": true,
  "modalities": ["text", "vision", "audio"],
  "quantization_support": ["fp16", "bf16", "fp8", "awq", "gptq", "gguf"],
  "vllm_compatible": true
}
